# coding=utf-8
# **********************************
# 011 - Множества (set и frozenset)
# Gosha Dudar, 2017
# **********************************
# Writing sgiman, 2017
# Last Modification, 2022, aug
# ----------------------------------
# повторы элементов игнороируются
# a = {} - словарь
# a = [23] - множевство
#

print("\n*** 1 ***")
a = set ("hello")
print(type(a))
print(a)

print("\n*** 2 ***")
a = {'23', 32}
print(type(a))
print(a)

print("\n*** 3 ***")
a = {i ** 2 for i in range (10)}
print(type(a))
print(a)

print("\n*** frozenset ***")
a = set("Hello")
b = frozenset("Qwerty")            # запрет для дабавления
a.add (1)
print (a)

print("\n*** 4 ***")
a = ['r', 's', 'w', 'a', 's', 'w']  # обычный спиоок
print (a)
print (set (a))                     # вывод множества

print("\n*** 5 ***")
a = {32, 45, 43.23, 76}
print(len (a))
x = 45
print (x in a)              # есть ли 'x' в множестве 'a'

print("\n*** 6 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 76, 43.23}
print(a.isdisjoint (x))    # если множестова 'a' и 'x' не имет общих элементов - true
print(a == x)

print("\n*** 7 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.update (x)                # обновляет множество 'a' с учетом множества 'х' (к 'a' добавляется 12)
print (a)

print ("\n*** 8 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.intersection_update (x)   # определить прересечение1 множеств - совпадающие элементы в 'x' и 'a'
print (a)

print("\n*** 9 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.difference_update (x)     # определить прересечение2 множеств - элементы которых нет в 'a'
print (a)

print("\n*** 10 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.symmetric_difference_update (x)   # определить элементы встречающиеся в одном множестве, но не встречающиеся в обоих
print (a)

print("\n*** 11 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.add(23)                   # добавить элемент
print(a)
a.remove (23)               # удалить элемент (если не найден, то error)
print(a)
a.discard (32)              # удалить элемент (без выдачи ошибки)
print(a)
a.pop()                     # удалить случайный элемент
print(a)
a.clear()                   # очистить множество
print(a)
