# coding=utf-8
# ***************************************************
# 014 - Работа с файлами
# Gosha Dudar, 2017
# ***************************************************
# Writing sgiman, 2017
# Last Modification, 2022, aug
# ---------------------------------------------------
# 'r' - открыть на чтение
# 'w' - открыть на заапись
# 'x' - открыть на хапись еслм файла не существует
# 'a' - открыть на дозапись
# 'b' - открытие в двоичном виде
# 't' - открыть в тексктовом режиме (default)
# '+' - открыть на чтенпе и запись
#
# f = open ('text.txt', 'rt')
# f = open ('text.txt', 'rb')

print("\n*** 1 ***")

# f = open ('text.txt')
# print (f.read ())
# print (f.read (4))
# for line in f:
#    print (line)

f = open('text.txt', 'w')
f.write('Hi, it\'s me!\nTest')
f.close()
